class КанцТовары
{
    public КанцТовары(string М, int Ц, int К, int П, int О, int Р)
    {
        Марка = М; Цена = Ц; Кол_во_На_Складе = К; Продано_За_День = П; Рейтинг = Р;
    }
    
    public КанцТовары()
    {
        Марка = "Нет наименований"; Цена = 0; Кол_во_На_Складе = 0; Продано_За_День = 0; Рейтинг = 0;
    }
    
    public string Марка;
    public int Цена, Кол_во_На_Складе, Продано_За_День, Рейтинг;
    
    public int Осталось_На_Складе
    {
        get { return Кол_во_На_Складе - Продано_За_День; }
    }
    
    public virtual string ПолучитьИнформацию()
    {
        return $"Марка: {Марка}, Цена: {Цена}руб., Осталось На Складе: {Осталось_На_Складе}, Рейтинг: {Рейтинг}";
    }
    
    public string Name { get; set; }
    
    public virtual void Print()
    {
        Console.WriteLine($"Имя: {Name}");
        Console.WriteLine($"Марка: {Марка}");
        Console.WriteLine($"Цена: {Цена} руб.");
        Console.WriteLine($"Осталось на складе: {Осталось_На_Складе}");
        Console.WriteLine($"Рейтинг: {Рейтинг}");
    }
}
